In [1]:
import numpy as np
import pandas as pd

create a series object

In [4]:
ser = pd.Series(np.random.randn(5), index= ['a', 'b', 'c', 'd', 'e'])#labels
print(ser)

a   -0.930099
b    0.455441
c   -0.857944
d    0.125874
e   -1.343956
dtype: float64

In [15]:
d = {"b": 1, "a": 0, "c": 2}
pd.Series(d) #keys become our indexes(labels) and the values become the values of that series
                 # 1, 0, 2 is the value
                 # 0, 1, 2 (which is not displayed) is the index
                 #label to the index; like an alias

b    1
a    0
c    2
dtype: int64

In [12]:
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories, index = ["day1", "day2"]) #has to use the ke as the index if we're passing in the dictionary
print(myvar)

day1    420
day2    380
dtype: int64

In [13]:
pd.Series(5.0, index=["a", "b", "c", "d", "e"]) #The value will be repeated to match the length of the index.

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

Dataframe
keys go from being the indexes/rows in series to being the columns in dataframes when you pass a dictionary

In [9]:
data = {'apple sales': [3,2,0,1,6,9], 'orange sales': [0,2,3,5,6,7]}
# df_sales = pd.DataFrame(data, index=['2000', '2001', '2002', '2003','2004', '2005'])
df_sales = pd.DataFrame(data, index=range(2000, 2006)) #also works but wo't be strings
df_sales

      apple sales  orange sales
2000            3             0
2001            2             2
2002            0             3
2003            1             5
2004            6             6
2005            9             7

In [15]:
#needs to be '2000' if using the string indexes above; referencing the labels that we were making
#can also be slices like .iloc [1:3]
sales= df_sales.loc[2002] 
#returns a series object; its not a series if we get more than one result back
# print(type(df_sales[2002])

#.iloc is for the indexes; uses the integer positions only
df_sales.iloc[1]
#can also use slices
df_sales.iloc[1:3]

#why would we want to transpose these; we wanna try and manipulate things by columns cause its faster than performing aggregates on rows.
#so we want to transpose the dataframe if we want to perform fucntions using the years instead of the apple sales(which would use many different places of memory and different data types; unlike rows)

#transpose creates a copy of the dataframe

      apple sales  orange sales
2001            2             2
2002            0             3

In [21]:
#adds column at 1 and orange sales got moved to two; 1, is called the column index
df_sales.insert(1, 'Strawberry sales', [4, 6, 5, 3, 2, 4], allow_duplicates=True)
#insert function always inserts a column; wont add it if it doesnt have the same amount of values/rows to be able to inserted
# df_sales.insert(1, 'Strawberry sales', [4, 6, 5, 3, 2], allow_duplicates=True) 
df_sales

,apple sales,Strawberry sales,pineapple sales,pineapple sales,orange sales
2000,3,4,4,4,0
2001,2,6,6,6,2
2002,0,5,5,5,3
2003,1,3,3,3,5
2004,6,2,2,2,6
2005,9,4,7,7,7

In [ ]:

#the parameted by sets the label of the row or column to sort by w/.sort_values()

# columns are panda series even in a dataframe, because a dataframe is a collection of series
df['symboling']=df['symboling']+1 #adds the integer value of 1 across the whole series

missing values in python: represented by ?, NaN, 0(shouldnt be a missing value) , Na
-check the data collection source
-drop the missing values: drop the variable, drop the data entry (when dealing with data do the thing that has the least impact)
-replace the missing values: raplace it with and average (of similair datapoinst); replace if by frequency; replace it based on other functions(used when the person knows what the missing data is)
-leave the missing data as missing data

to remove data from missing values df.dropna()
axis=0 drops the the entire row 
axis=1 drops the entire column

df.dropna(subset=['price'], axis = 0, inplace=True) inlace=True is just showing us a view of what it would look like, it wouldnt change anything; you can save it to a new variable 

# df.replace(missing_value, new_value) ; the defualt setting inplace is fales so it does not change the original dataframe ; this returns a new dataframe object that ifyooud dont set to a new variable is useless and lost ; looks for none values by default
mean =df['normalized-loses'].mean() # the mean method disregaurds the NaN values
df['normalized-loses'].replace(np.nan, mean)

Data formatting

df['city-mpg'] = 235/df['city-mpg']
df.rename(columns={'city-mpg': 'city-L/100km'}, inplace=True)


sometimes the wrong data type is assigned to a feature
dataframe.dtypes() checks the datatype for each column
~This returns a Series with the data type of each column. The result’s index is the original DataFrame’s columns. Columns with mixed types are stored with the object dtype

dataframe.astype()
df['price'] = df['price'].astype('int') #1 single brackeyt access it as series and a doulbe access it as a dataframe(changes it as a dataframe)


Data normalization

simple feature scaling: x_new = x_old/x_max , # main takeaway for now
min-max: x_new = x_old - x_min/x_max-x_min , 
z-score: x_new/x_old-mu(mean of the sample)/sigma(standard deviation of the sample)

df['length']=df['length']/df['length'].max()


Binning in Python(method of data preprocessing): Grouping of values into "bins"

bins = np.linespace(min(df['price']), max(df['price']), 4)
group_names = ['low', 'medium', 'high']
df['price-binned']=pd.cut(df['price'], bins, labels=group_names, include_lowest=True) passing in the price column and bins. working on our object instead of our dataset

Categorical Variables into Quantative Variables

most stats models cannot take in the objects/strings as input
One-Hot encoding
add dummy variables f/e unigue category(columns)
assign 0 ir 1 in each category
pd.get_dummies(df['fuel']) # creates additional columns by adding a true false ea

In [27]:
# Define a dictionary containing Students data
data = {'Name': ['Jane', 'Princi', 'James', 'Fadi'],
        'Height': [5.1, 6.2, 5.1, 5.2],
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc'],
       'Score 1' : [56,86,77,45],
       'Score 2' : [50,96,60,30]}
print("------before -------")  
# Convert the dictionary into DataFrame
df = pd.DataFrame(data)
print(df)
print("------after adding column -------")
# using DataFrame.assign() method adding 'Address' column and equating it to the list
df = df.assign(address = ['NYC', 'NJ', 'CA', 'PA'])
print(df)
print("------after sorting -------")
print(df.sort_values(by='Score 1', ascending=False))

print(df.sort_values(by=[ 'Height','Score 1'], ascending=[False, True]))

------before -------
     Name  Height Qualification  Score 1  Score 2
0    Jane     5.1           Msc       56       50
1  Princi     6.2            MA       86       96
2   James     5.1           Msc       77       60
3    Fadi     5.2           Msc       45       30
------after adding column -------
     Name  Height Qualification  Score 1  Score 2 address
0    Jane     5.1           Msc       56       50     NYC
1  Princi     6.2            MA       86       96      NJ
2   James     5.1           Msc       77       60      CA
3    Fadi     5.2           Msc       45       30      PA
------after sorting -------
     Name  Height Qualification  Score 1  Score 2 address
1  Princi     6.2            MA       86       96      NJ
2   James     5.1           Msc       77       60      CA
0    Jane     5.1           Msc       56       50     NYC
3    Fadi     5.2           Msc       45       30      PA
     Name  Height Qualification  Score 1  Score 2 address
1  Princi     6.2            MA       86       96      NJ
3    Fadi     5.2           Msc       45       30      PA
0    Jane     5.1           Msc       56       50     NYC
2   James     5.1           Msc       77       60      CA

In [29]:
print(df['Score 1'] > 70)
print(type(df['Score 1'] > 70))

0    False
1     True
2     True
3    False
Name: Score 1, dtype: bool
<class 'pandas.core.series.Series'>

In [33]:
print(df[df['Score 1'] > 70]) #w/o the second df we're not getting all the columns from the dataframe
print(type(df[df['Score 1'] > 70]))

     Name  Height Qualification  Score 1  Score 2 address
1  Princi     6.2            MA       86       96      NJ
2   James     5.1           Msc       77       60      CA
<class 'pandas.core.frame.DataFrame'>

In [36]:
print(df[(df['Score 1'] >= 70) & (df['Score 2'] >= 80)])

     Name  Height Qualification  Score 1  Score 2 address
1  Princi     6.2            MA       86       96      NJ

In [43]:
print(df.describe()) # isn't counting any of the columns with object data type
df.describe(include= 'all') # so we can include all

         Height    Score 1   Score 2
count  4.000000   4.000000   4.00000
mean   5.400000  66.000000  59.00000
std    0.535413  18.814888  27.64055
min    5.100000  45.000000  30.00000
25%    5.100000  53.250000  45.00000
50%    5.150000  66.500000  55.00000
75%    5.450000  79.250000  69.00000
max    6.200000  86.000000  96.00000

        Name    Height Qualification    Score 1   Score 2 address
count      4  4.000000             4   4.000000   4.00000       4
unique     4       NaN             2        NaN       NaN       4
top     Jane       NaN           Msc        NaN       NaN     NYC
freq       1       NaN             3        NaN       NaN       1
mean     NaN  5.400000           NaN  66.000000  59.00000     NaN
std      NaN  0.535413           NaN  18.814888  27.64055     NaN
min      NaN  5.100000           NaN  45.000000  30.00000     NaN
25%      NaN  5.100000           NaN  53.250000  45.00000     NaN
50%      NaN  5.150000           NaN  66.500000  55.00000     NaN
75%      NaN  5.450000           NaN  79.250000  69.00000     NaN
max      NaN  6.200000           NaN  86.000000  96.00000     NaN